server/loadtest-socketio.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 20
      name: warm-up
    - duration: 120
      arrivalRate: 50
      name: ramp
    - duration: 180
      arrivalRate: 100
      name: peak
  processor: "./loadtest-socketio-processor.cjs"
  engines:
    socketio-v3: {}
  variables:
    channelId: "gen"
scenarios:
  - name: "socket connect + join + send messages"
    engine: socketio-v3
    flow:
      - function: "assignUser"
      - emit:
          channel: "user:join"
          data: "{{ userId }}"
      - emit:
          channel: "join"
          data: "{{ channelId }}"
      - think: 2
      - loop:
          - emit:
              channel: "message:send"
              data:
                channelId: "{{ channelId }}"
                text: "loadtest {{ $loopCount }} from {{ userId }}"
                senderId: "{{ userId }}"
                senderName: "LoadTest"
                senderAvatarUrl: null
                priority: "normal"
          - think: 5
        count: 6